In [4]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [1]:
#installing wordtonumber to convert words to numbers
!pip install word2number

Collecting word2number
  Using cached word2number-1.1-py3-none-any.whl
Installing collected packages: word2number
Successfully installed word2number-1.1

In [13]:
from word2number import w2n

In [8]:
#reading csv file having prices of houses with multiple parameters
df = pd.read_csv("C:/Users/admin/CodeBasics Machine Learning/Machine_Learning_py/1_Linear_Reg_Multivariate/salarywithmultipleparameters.csv")
df

  experience  test_score  interview_score(out of 10)  salary($)
0        NaN         8.0                           9      50000
1        NaN         8.0                           6      45000
2       five         6.0                           7      60000
3        two        10.0                          10      65000
4      seven         9.0                           6      70000
5      three         7.0                          10      62000
6        ten         NaN                           7      72000
7     eleven         7.0                           8       8000

In [9]:
#As we can see above there is a empty value so will fill it with median
median_testscore = df.test_score.median()

In [10]:
df.test_score.fillna(median_testscore)

0     8.0
1     8.0
2     6.0
3    10.0
4     9.0
5     7.0
6     8.0
7     7.0
Name: test_score, dtype: float64

In [12]:
#filling the datafram
df.test_score = df.test_score.fillna(median_testscore)
df

  experience  test_score  interview_score(out of 10)  salary($)
0        NaN         8.0                           9      50000
1        NaN         8.0                           6      45000
2       five         6.0                           7      60000
3        two        10.0                          10      65000
4      seven         9.0                           6      70000
5      three         7.0                          10      62000
6        ten         8.0                           7      72000
7     eleven         7.0                           8       8000

In [20]:
#filling nan with 0 in experience column
df.experience = df.experience.fillna('zero')
df

  experience  test_score  interview_score(out of 10)  salary($)
0       zero         8.0                           9      50000
1       zero         8.0                           6      45000
2       five         6.0                           7      60000
3        two        10.0                          10      65000
4      seven         9.0                           6      70000
5      three         7.0                          10      62000
6        ten         8.0                           7      72000
7     eleven         7.0                           8       8000

In [22]:
#converting word2number
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score  interview_score(out of 10)  salary($)
0           0         8.0                           9      50000
1           0         8.0                           6      45000
2           5         6.0                           7      60000
3           2        10.0                          10      65000
4           7         9.0                           6      70000
5           3         7.0                          10      62000
6          10         8.0                           7      72000
7          11         7.0                           8       8000

In [25]:
reg = linear_model.LinearRegression()
reg.fit(df[['experience','test_score','interview_score(out of 10)']],df['salary($)'])

LinearRegression()

In [26]:
reg.predict([[2,9,6]])

array([65253.60592828])